Revit 2027 API
IStructuralSectionsServer Interface
 Interface for the section type parameter server to implement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IStructuralSectionsServer : IExternalServer
Public Interface IStructuralSectionsServer
	Inherits IExternalServer
public interface class IStructuralSectionsServer : IExternalServer
type IStructuralSectionsServer =
    interface
        interface IExternalServer
    end
The IStructuralSectionsServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
StructuralSectionsUpdate |  The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace